Synwit-Co-Ltd/SWM231_Lib/SWM231_StdPeriph_Driver/CSL/SWM231_StdPeriph_Driver/SWM231_qspi.c
			p_word[i] = QSPIx->DRW;
		}
		
		if((count % 4) / 2)
		{
			uint16_t * p_half = (uint16_t *)&buff[n_word * 4];
			
			while(QSPI_FIFOCount(QSPIx) < 2) __NOP();
			
			p_half[0] = QSPIx->DRH;
		}
		
		if(count % 2)
		{
			while(QSPI_FIFOCount(QSPIx) < 1) __NOP();
			
			buff[count - 1] = QSPIx->DRB;
		}
	}
	else
	{
		for(int i = 0; i < count; i++)
		{
			while(QSPI_FIFOCount(QSPIx) < 1) __NOP();
			
			buff[i] = QSPIx->DRB;
		}
	}
	
	QSPI_Abort(QSPIx);
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_FlashBusy()
* 功能说明:	QSPI Flash 忙查询
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 输    出: bool					SPI Flash 是否正在执行内部擦、写操作
* 注意事项: 无
******************************************************************************************************************************************/
bool QSPI_FlashBusy(QSPI_TypeDef * QSPIx)
{
	uint16_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG1, 1);
	
	bool busy = (reg & (1 << QSPI_STATUS_REG1_BUSY_Pos));
	
	return busy;
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_QuadState()
* 功能说明:	QSPI Flash QE 查询
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 输    出: uint8_t					1 QE 使能   0 QE 禁止
* 注意事项: 不同品牌 SPI Flash 中，QE 在 Status Register 中的位置可能不同
******************************************************************************************************************************************/
uint8_t QSPI_QuadState(QSPI_TypeDef * QSPIx)
{
	uint8_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG2, 1);
	
	return (reg & (1 << QSPI_STATUS_REG2_QUAD_Pos)) ? 1 : 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_QuadSwitch()
* 功能说明:	QSPI Flash QE 开关
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
*			uint8_t on				1 QE 使能   0 QE 禁止
* 输    出: 无
* 注意事项: 不同品牌 SPI Flash 中，QE 在 Status Register 中的位置可能不同
******************************************************************************************************************************************/
void QSPI_QuadSwitch(QSPI_TypeDef * QSPIx, uint8_t on)
{
	uint8_t reg = QSPI_ReadReg(QSPIx, QSPI_CMD_READ_STATUS_REG2, 1);
	
	if(on)
		reg |=  (1 << QSPI_STATUS_REG2_QUAD_Pos);
	else
		reg &= ~(1 << QSPI_STATUS_REG2_QUAD_Pos);
	
	QSPI_WriteEnable(QSPIx);
	
	QSPI_WriteReg(QSPIx, QSPI_CMD_WRITE_STATUS_REG2, reg, 1);
	
	while(QSPI_FlashBusy(QSPIx)) __NOP();
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_ReadReg()
* 功能说明:	QSPI Flash 寄存器读取，适用于只有命令、数据阶段，且数据不多于4字节的情况
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
*			uint8_t cmd				寄存器读取命令
*			uint8_t n_bytes			要读取的字节数，可取值 1、2、3、4
* 输    出: uint32_t				读取到的数据，MSB
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t QSPI_ReadReg(QSPI_TypeDef * QSPIx, uint8_t cmd, uint8_t n_bytes)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_1bit;
	cmdStruct.Instruction 		 = cmd;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = 0;
	cmdStruct.DataMode 			 = QSPI_PhaseMode_1bit;
	cmdStruct.DataCount 		 = n_bytes;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectRead, &cmdStruct);
	
	while(QSPI_FIFOCount(QSPIx) < n_bytes) __NOP();
	
	uint32_t data = 0;
	for(int i = n_bytes; i > 0; i--)
		((uint8_t *)&data)[i-1] = QSPIx->DRB;
	
	return data;
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_WriteReg()
* 功能说明:	QSPI Flash 寄存器写入，适用于只有命令、数据阶段，且数据不多于4字节的情况
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
*			uint8_t cmd				寄存器写入命令
*			uint32_t data			要写入寄存器的数据，MSB
*			uint8_t n_bytes			要写入寄存器的字节数，可取值 1、2、3、4、0（用于无数据阶段命令）
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void QSPI_WriteReg(QSPI_TypeDef * QSPIx, uint8_t cmd, uint32_t data, uint8_t n_bytes)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_1bit;
	cmdStruct.Instruction 		 = cmd;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = 0;
	cmdStruct.DataMode 			 = n_bytes ? QSPI_PhaseMode_1bit : QSPI_PhaseMode_None;
	cmdStruct.DataCount 		 = n_bytes;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectWrite, &cmdStruct);
	
	for(int i = n_bytes; i > 0; i--)
		QSPIx->DRB = ((uint8_t *)&data)[i-1];
	
	while(QSPI_Busy(QSPIx)) __NOP();
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_INTEn()
* 功能说明:	中断使能
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 			uint32_t it				interrupt type，可取值 QSPI_IT_ERR、QSPI_IT_DONE、QSPI_IT_FFTHR、QSPI_IT_PSMAT、QSPI_IT_TO 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void QSPI_INTEn(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->CR |=  (it << 16);
}

/****************************************************************************************************************************************** 
* 函数名称:	QSPI_INTDis()
* 功能说明:	中断禁止
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 			uint32_t it				interrupt type，可取值 QSPI_IT_ERR、QSPI_IT_DONE、QSPI_IT_FFTHR、QSPI_IT_PSMAT、QSPI_IT_TO 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void QSPI_INTDis(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->CR &= ~(it << 16);
}

/****************************************************************************************************************************************** 
* 函数名称:	QSPI_INTClr()
* 功能说明:	中断标志清除
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 			uint32_t it				interrupt type，可取值 QSPI_IT_ERR、QSPI_IT_DONE、QSPI_IT_PSMAT、QSPI_IT_TO 及其“或”
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void QSPI_INTClr(QSPI_TypeDef * QSPIx, uint32_t it)
{
	QSPIx->FCR = it;
}

/****************************************************************************************************************************************** 
* 函数名称:	QSPI_INTStat()
* 功能说明:	中断状态查询
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
* 			uint32_t it				interrupt type，可取值 QSPI_IT_ERR、QSPI_IT_DONE、QSPI_IT_FFTHR、QSPI_IT_PSMAT、QSPI_IT_TO 及其“或”
* 输    出: uint32_t				0 中断未发生    非0 中断已发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t QSPI_INTStat(QSPI_TypeDef * QSPIx, uint32_t it)
{
	return QSPIx->SR & it;
}


/****************************************************************************************************************************************** 
* 函数名称:	QSPI_SPI_Write_()
* 功能说明:	QSPI 用作普通 SPI 写
* 输    入: QSPI_TypeDef * QSPIx	指定要被设置的QSPI接口，有效值包括QSPI0
*			uint8_t buff[]			要写的数据
*			uint32_t count			要写的数据个数
*			uint8_t data_width		写入使用的数据线个数，有效值包括 1、2、4
*			uint8_t data_phase		是否在此函数内执行数据阶段；若否，可在后续通过 DMA 实现更高效的写入
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void QSPI_SPI_Write_(QSPI_TypeDef * QSPIx, uint8_t buff[], uint32_t count, uint8_t data_width, uint8_t data_phase)
{
	QSPI_CmdStructure cmdStruct;
	QSPI_CmdStructClear(&cmdStruct);
	
	cmdStruct.InstructionMode 	 = QSPI_PhaseMode_None;
	cmdStruct.AddressMode 		 = QSPI_PhaseMode_None;
	cmdStruct.AlternateBytesMode = QSPI_PhaseMode_None;
	cmdStruct.DummyCycles 		 = 0;
	cmdStruct.DataMode 			 = (data_width == 1) ? QSPI_PhaseMode_1bit : ((data_width == 2) ? QSPI_PhaseMode_2bit : QSPI_PhaseMode_4bit);
	cmdStruct.DataCount 		 = count;
	
	QSPI_Command(QSPIx, QSPI_Mode_IndirectWrite, &cmdStruct);
	
	if(data_phase == 0)
		return;
	
	if((uint32_t)buff % 4 == 0)	// word aligned
	{
		uint32_t n_word = count / 4;
		
		for(int i = 0; i < n_word; i++)
		{
			uint32_t * p_word = (uint32_t *)buff;
			
			while(QSPI_FIFOSpace(QSPIx) < 4) __NOP();
			
			QSPIx->DRW = p_word[i];
		}
		
